pmorgantech/WaveX/firmware/esp32/tests/unit/ui/file_browser_test.cpp
#include <gtest/gtest.h>

#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <string>
#include <vector>

// Include mock headers to get type definitions
#include "../../mocks/esp32_mocks.h"
#include "comm/comm_interface_impl.h"
#include "comm/statistics.h"
#include "file_browser.h"
#include "lvgl.h"
#include "spi_protocol/protocol.h"
#include "ui_theme.h"

// wavex_ui_mark_content_changed and esp_timer_get_time are provided by
// ui_mocks.cpp / esp32_mocks.cpp; only the LVGL port lock has no other
// definition in the test build.
extern "C" {
void esp_lvgl_port_lock(void) {}
void esp_lvgl_port_unlock(void) {}
}

// Mock FreeRTOS
#include "freertos/FreeRTOS.h"

// Mock UI theme constants
#define UI_COLOR_CONTENT {0, 0, 0}
#define UI_PADDING_SMALL 4
#define UI_PADDING_MEDIUM 8
#define LV_ALIGN_TOP_LEFT 0
#define LV_PART_MAIN 0

class FileBrowserTest : public ::testing::Test {
   protected:
    void SetUp() override {
        // Reset any global state if needed
    }

    void TearDown() override {
        // Cleanup handled by test
    }

    // Helper to create a minimal browser structure for testing navigation logic
    wavex_file_browser_t* CreateMinimalBrowser(const char* path, uint32_t entry_count) {
        wavex_file_browser_t* browser = (wavex_file_browser_t*)malloc(sizeof(wavex_file_browser_t));
        if (!browser)
            return nullptr;

        memset(browser, 0, sizeof(wavex_file_browser_t));
        strncpy(browser->current_path, path, sizeof(browser->current_path) - 1);
        browser->current_path[sizeof(browser->current_path) - 1] = '\0';

        browser->entry_count = entry_count;
        browser->selected_index = 0;
        browser->first_visible_index = 0;
        browser->visible_count = 8;

        // Allocate entries
        browser->entries = (wavex_file_entry_t*)malloc(entry_count * sizeof(wavex_file_entry_t));
        if (browser->entries) {
            for (uint32_t i = 0; i < entry_count; i++) {
                snprintf(
                    browser->entries[i].name, sizeof(browser->entries[i].name), "file%02u.wav", i);
                snprintf(browser->entries[i].path,
                         sizeof(browser->entries[i].path),
                         "%s/file%02u.wav",
                         path,
                         i);
                browser->entries[i].is_directory = false;
                browser->entries[i].size_bytes = 1000 + i;
            }
        }

        return browser;
    }

    void DestroyBrowser(wavex_file_browser_t* browser) {
        if (browser) {
            if (browser->entries) {
                free(browser->entries);
            }
            free(browser);
        }
    }
};

// Test: Navigate up from subdirectory
TEST_F(FileBrowserTest, NavigateUpFromSubdirectory) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/SOUNDS", 5);
    ASSERT_NE(browser, nullptr);

    // Navigation should update the path even if browse request fails
    wavex_file_browser_navigate_up(browser);

    // Check that path was updated correctly (browse request may fail in test environment)
    EXPECT_STREQ("/", browser->current_path);

    DestroyBrowser(browser);
}

// Test: Navigate up from root (should fail)
TEST_F(FileBrowserTest, NavigateUpFromRoot) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 5);
    ASSERT_NE(browser, nullptr);

    bool result = wavex_file_browser_navigate_up(browser);

    EXPECT_FALSE(result);
    EXPECT_STREQ("/", browser->current_path);  // Should remain at root

    DestroyBrowser(browser);
}

// Test: Navigate up from nested directory
TEST_F(FileBrowserTest, NavigateUpFromNestedDirectory) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/SOUNDS/DRUMS", 5);
    ASSERT_NE(browser, nullptr);

    // Navigation should update the path even if browse request fails
    wavex_file_browser_navigate_up(browser);

    // Check that path was updated correctly (browse request may fail in test environment)
    EXPECT_STREQ("/SOUNDS", browser->current_path);

    DestroyBrowser(browser);
}

// Test: Navigate down entry (move selection down)
TEST_F(FileBrowserTest, NavigateDownEntry) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 0;

    bool result = wavex_file_browser_navigate_down_entry(browser);

    EXPECT_TRUE(result);
    EXPECT_EQ(1u, browser->selected_index);

    DestroyBrowser(browser);
}

// Test: Navigate down entry at last position (should fail)
TEST_F(FileBrowserTest, NavigateDownEntryAtLast) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 9;  // Last entry

    bool result = wavex_file_browser_navigate_down_entry(browser);

    EXPECT_FALSE(result);
    EXPECT_EQ(9u, browser->selected_index);  // Should remain at last

    DestroyBrowser(browser);
}

// Test: Navigate up entry (move selection up)
TEST_F(FileBrowserTest, NavigateUpEntry) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 5;

    bool result = wavex_file_browser_navigate_up_entry(browser);

    EXPECT_TRUE(result);
    EXPECT_EQ(4u, browser->selected_index);

    DestroyBrowser(browser);
}

// Test: Navigate up entry at first position (should fail)
TEST_F(FileBrowserTest, NavigateUpEntryAtFirst) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 0;

    bool result = wavex_file_browser_navigate_up_entry(browser);

    EXPECT_FALSE(result);
    EXPECT_EQ(0u, browser->selected_index);  // Should remain at first

    DestroyBrowser(browser);
}

// Test: Navigate down entry with empty browser (should fail)
TEST_F(FileBrowserTest, NavigateDownEntryEmptyBrowser) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 0);
    ASSERT_NE(browser, nullptr);

    bool result = wavex_file_browser_navigate_down_entry(browser);

    EXPECT_FALSE(result);

    DestroyBrowser(browser);
}

// Test: Set selection with valid index
TEST_F(FileBrowserTest, SetSelectionValidIndex) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);

