pmorgantech/WaveX/firmware/esp32/tests/unit/ui/file_browser_test.cpp
    // Delivers a browse response exactly the way the UART RX task does: via
    // the statistics manager's listener slot.
    void Respond(uint32_t total_count, const std::vector<FileEntryWire>& entries) {
        std::vector<uint8_t> payload = Correlate(BuildBrowsePayload(total_count, entries));
        stats_->invoke_browse_resp_callback(payload.data(), payload.size());
        wavex_file_browser_process_pending_updates(browser_);
    }

    int parent_ = 0;  // opaque dummy for the LVGL mock
    StatisticsManager* stats_ = nullptr;
    WaveX::Comm::CommInterfaceImpl* comm_ = nullptr;
    wavex_file_browser_config_t config_{};
    wavex_file_browser_t* browser_ = nullptr;
};

TEST_F(FileBrowserResponseTest, CreateSendsInitialBrowseRequestForRoot) {
    const auto& cap = GetInterMcuCapture();
    EXPECT_EQ(cap.browse_req_calls, 1);
    EXPECT_STREQ(cap.browse_req_path, "/");
    EXPECT_EQ(cap.browse_req_start_index, 0);
    // Unknown storage state must present as mounted until told otherwise.
    EXPECT_TRUE(wavex_file_browser_is_storage_mounted(browser_));
}

TEST_F(FileBrowserResponseTest, SinglePageResponsePopulatesEntriesWithMetadata) {
    Respond(2,
            {FileEntryWire(1, 0, "DRUMS"), FileEntryWire(0, 88200, "kick.wav", 44100, 2, 16, 500)});

    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 2u);

    const wavex_file_entry_t* dir = wavex_file_browser_get_entry(browser_, 0);
    ASSERT_NE(dir, nullptr);
    EXPECT_STREQ(dir->name, "DRUMS");
    EXPECT_TRUE(dir->is_directory);

    const wavex_file_entry_t* file = wavex_file_browser_get_entry(browser_, 1);
    ASSERT_NE(file, nullptr);
    EXPECT_STREQ(file->name, "kick.wav");
    EXPECT_FALSE(file->is_directory);
    EXPECT_EQ(file->size_bytes, 88200u);
    EXPECT_EQ(file->sample_rate, 44100u);
    EXPECT_EQ(file->channels, 2);
    EXPECT_EQ(file->bits_per_sample, 16);
    EXPECT_EQ(file->duration_ms, 500u);
}

// A leading slash in the wire name (the Daisy sometimes sends one) must be
// stripped, and paths under a subdirectory must join without double slashes.
TEST_F(FileBrowserResponseTest, SubdirectoryPathsAreJoinedCorrectly) {
    wavex_file_browser_navigate_to(browser_, "/SOUNDS");
    Respond(2, {FileEntryWire(0, 100, "/kick.wav"), FileEntryWire(0, 200, "snare.wav")});

    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 2u);
    const wavex_file_entry_t* first = wavex_file_browser_get_entry(browser_, 0);
    ASSERT_NE(first, nullptr);
    EXPECT_STREQ(first->name, "kick.wav") << "leading slash was not stripped";
    EXPECT_STREQ(first->path, "/SOUNDS/kick.wav");
    const wavex_file_entry_t* second = wavex_file_browser_get_entry(browser_, 1);
    ASSERT_NE(second, nullptr);
    EXPECT_STREQ(second->path, "/SOUNDS/snare.wav");
}

// At root the join must produce "/name", not "//name" (the pre-fix behavior:
// the leading slash was stripped from the name, then "%s/%s" of "/" + name
// doubled it back).
TEST_F(FileBrowserResponseTest, RootPathsAreJoinedWithoutDoubleSlash) {
    Respond(2, {FileEntryWire(0, 100, "/kick.wav"), FileEntryWire(1, 0, "DRUMS")});

    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 2u);
    const wavex_file_entry_t* file = wavex_file_browser_get_entry(browser_, 0);
    ASSERT_NE(file, nullptr);
    EXPECT_STREQ(file->path, "/kick.wav");
    const wavex_file_entry_t* dir = wavex_file_browser_get_entry(browser_, 1);
    ASSERT_NE(dir, nullptr);
    EXPECT_STREQ(dir->path, "/DRUMS");
}

// ".." must be hoisted to the top of the first page when not at root, so the
// user can always leave a directory without scrolling.
TEST_F(FileBrowserResponseTest, ParentDirEntryIsSortedFirstOutsideRoot) {
    wavex_file_browser_navigate_to(browser_, "/SOUNDS");
    Respond(3,
            {FileEntryWire(0, 100, "a.wav"),
             FileEntryWire(1, 0, ".."),
             FileEntryWire(0, 200, "b.wav")});

    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 3u);
    EXPECT_STREQ(wavex_file_browser_get_entry(browser_, 0)->name, "..");
    EXPECT_STREQ(wavex_file_browser_get_entry(browser_, 1)->name, "a.wav");
    EXPECT_STREQ(wavex_file_browser_get_entry(browser_, 2)->name, "b.wav");
}

// More files than one page: the first page must display immediately AND
// trigger a follow-up request at the right start index; the second response
// must append, not replace.
TEST_F(FileBrowserResponseTest, PaginationRequestsNextPageAndAccumulates) {
    unsigned directory_notifications = 0;
    wavex_file_browser_set_directory_changed_callback(
        browser_,
        [](const char*, void* context) { ++*static_cast<unsigned*>(context); },
        &directory_notifications);
    const auto& cap = GetInterMcuCapture();
    ASSERT_EQ(cap.browse_req_calls, 1);  // from create

    std::vector<FileEntryWire> page0;
    for (int i = 0; i < 20; ++i) {
        char name[16];
        snprintf(name, sizeof(name), "f%02d.wav", i);
        page0.push_back(FileEntryWire(0, 100 + i, name));
    }
    Respond(25, page0);

    // First page is visible immediately...
    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 20u);
    // ...and the next page was requested where this one ended.
    EXPECT_EQ(cap.browse_req_calls, 2);
    EXPECT_EQ(cap.browse_req_start_index, 20);
    EXPECT_EQ(directory_notifications, 1u);
    wavex_file_browser_set_selection(browser_, 1);

    std::vector<FileEntryWire> page1;
    for (int i = 20; i < 25; ++i) {
        char name[16];
        snprintf(name, sizeof(name), "f%02d.wav", i);
        page1.push_back(FileEntryWire(0, 100 + i, name));
    }
    Respond(25, page1);

    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 25u);
    EXPECT_STREQ(wavex_file_browser_get_entry(browser_, 0)->name, "f00.wav");
    EXPECT_STREQ(wavex_file_browser_get_entry(browser_, 24)->name, "f24.wav");
    // Pagination is complete: no third request.
    EXPECT_EQ(cap.browse_req_calls, 2);
    EXPECT_EQ(directory_notifications, 1u);
    EXPECT_EQ(wavex_file_browser_get_selected_index(browser_), 1u);
}

// An empty listing is authoritative and can arrive UNSOLICITED (SD ejected):
// it must clear the stale listing and reset the selection.
TEST_F(FileBrowserResponseTest, StorageLossClearsStaleListing) {
    Respond(2, {FileEntryWire(0, 100, "a.wav"), FileEntryWire(0, 200, "b.wav")});
    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 2u);
    wavex_file_browser_set_selection(browser_, 1);

    stats_->invoke_storage_status_callback(false);
    wavex_file_browser_process_pending_updates(browser_);

    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 0u);
    EXPECT_EQ(wavex_file_browser_get_selected_index(browser_), 0u);
    EXPECT_EQ(wavex_file_browser_get_selected(browser_), nullptr);
}

