pmorgantech/WaveX/firmware/esp32/tests/unit/ui/file_browser_test.cpp
// Truncated / malformed payloads must be rejected without touching memory
// past the buffer; the browser presents an empty (error) listing.
TEST_F(FileBrowserResponseTest, MalformedPayloadsAreRejected) {
    Respond(1, {FileEntryWire(0, 100, "a.wav")});
    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 1u);

    // Shorter than the header.
    uint8_t junk[3] = {0x01, 0x02, 0x03};
    stats_->invoke_browse_resp_callback(junk, sizeof(junk));
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 1u);

    // Header claims more entries than the payload carries. Refresh first so
    // the browser is in a clean listing cycle.
    wavex_file_browser_refresh(browser_);
    Respond(1, {FileEntryWire(0, 100, "a.wav")});
    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 1u);
    std::vector<uint8_t> lying = BuildBrowsePayload(5, {FileEntryWire(0, 100, "a.wav")});
    BrowseRespHeader bad_header(5, 5);  // claims 5 entries, carries 1
    memcpy(lying.data(), &bad_header, sizeof(bad_header));
    lying = Correlate(lying);
    stats_->invoke_browse_resp_callback(lying.data(), lying.size());
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 1u);
}

// A name at the wire-format maximum (47 chars + NUL) must survive intact,
// and a full path longer than the 96-byte path field must be truncated with
// termination, not overflowed.
TEST_F(FileBrowserResponseTest, NamesAtBufferLimitAreBoundedAndTerminated) {
    std::string long_name(43, 'n');
    long_name += ".wav";  // 47 chars: the longest name the wire can carry
    ASSERT_EQ(long_name.size(), 47u);

    std::string deep_path = "/";
    deep_path += std::string(70, 'd');  // 71-char directory path
    wavex_file_browser_navigate_to(browser_, deep_path.c_str());

    Respond(1, {FileEntryWire(0, 100, long_name.c_str())});

    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 1u);
    const wavex_file_entry_t* entry = wavex_file_browser_get_entry(browser_, 0);
    ASSERT_NE(entry, nullptr);
    EXPECT_STREQ(entry->name, long_name.c_str());

    // 71 (dir) + 1 (slash) + 47 (name) = 119 > 95: must truncate in-bounds.
    EXPECT_EQ(strlen(entry->path), sizeof(entry->path) - 1);
    EXPECT_EQ(strncmp(entry->path, deep_path.c_str(), deep_path.size()), 0);
}

TEST_F(FileBrowserResponseTest, MaxEntriesCapIsRespected) {
    // Rebuild with a small cap.
    wavex_file_browser_destroy(browser_);
    config_.max_entries = 5;
    browser_ = wavex_file_browser_create(reinterpret_cast<lv_obj_t*>(&parent_), &config_);
    ASSERT_NE(browser_, nullptr);

    std::vector<FileEntryWire> page;
    for (int i = 0; i < 10; ++i) {
        char name[16];
        snprintf(name, sizeof(name), "f%02d.wav", i);
        page.push_back(FileEntryWire(0, 100, name));
    }
    Respond(10, page);

    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 5u);
    // The cap also ends pagination: no follow-up request for entries that
    // could never be stored.
    EXPECT_EQ(GetInterMcuCapture().browse_req_calls, 2);  // create + rebuild only
}

// SD-eject then re-insert: the mounted flag must track the notifications, and
// a re-insert must re-list the current directory automatically.
TEST_F(FileBrowserResponseTest, StorageStatusUpdatesFlagAndRelistsOnMount) {
    const auto& cap = GetInterMcuCapture();
    ASSERT_EQ(cap.browse_req_calls, 1);

    stats_->invoke_storage_status_callback(false);
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_FALSE(wavex_file_browser_is_storage_mounted(browser_));
    EXPECT_EQ(cap.browse_req_calls, 1) << "loss must not trigger a re-list";

    stats_->invoke_storage_status_callback(true);
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_TRUE(wavex_file_browser_is_storage_mounted(browser_));
    EXPECT_EQ(cap.browse_req_calls, 2) << "re-insert must re-list";
    EXPECT_STREQ(cap.browse_req_path, "/");
}

// Destroy must deregister both listeners BEFORE freeing: a response arriving
// after destroy (reachable by pressing Back mid-pagination) must be a no-op,
// not a write through freed memory.
TEST_F(FileBrowserResponseTest, DestroyDeregistersListeners) {
    wavex_file_browser_destroy(browser_);
    browser_ = nullptr;

    Respond(1, {FileEntryWire(0, 100, "late.wav")});
    stats_->invoke_storage_status_callback(true);
    wavex_file_browser_process_pending_updates(browser_);
    // Reaching here without touching freed memory is the point; ASan/valgrind
    // turns a regression into a hard failure.
    SUCCEED();
}

// The callback allocates one 20-entry page. A fully-sized payload with a
// larger count must be rejected, not parsed partially and then copied using
// the original wire count (which reads beyond the temporary allocation).
TEST_F(FileBrowserResponseTest, OversizedPageIsRejectedBeforeCopyingTemporaryEntries) {
    std::vector<FileEntryWire> page(21, FileEntryWire(0, 100, "kick.wav"));
    Respond(21, page);
    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 0u);
    EXPECT_EQ(browser_->loaded_entries, 0u);
    EXPECT_EQ(GetInterMcuCapture().browse_req_calls, 1);
}

TEST_F(FileBrowserResponseTest, FullSizePageRetainsEveryEntry) {
    std::vector<FileEntryWire> page(20, FileEntryWire(0, 100, "kick.wav"));
    Respond(20, page);
    EXPECT_EQ(wavex_file_browser_get_entry_count(browser_), 20u);
    EXPECT_EQ(browser_->loaded_entries, 20u);
    EXPECT_EQ(GetInterMcuCapture().browse_req_calls, 1);
}

TEST_F(FileBrowserResponseTest, UnterminatedWireNameIsBoundedEvenInDebugLogging) {
    auto payload = BuildBrowsePayload(1, {FileEntryWire()});
    std::fill(payload.begin() + sizeof(BrowseRespHeader), payload.end(), 'n');
    payload = Correlate(payload);
    stats_->invoke_browse_resp_callback(payload.data(), payload.size());
    wavex_file_browser_process_pending_updates(browser_);
    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), 1u);
    const auto* entry = wavex_file_browser_get_entry(browser_, 0);
    ASSERT_NE(entry, nullptr);
    EXPECT_EQ(strlen(entry->name), sizeof(entry->name) - 1);
    EXPECT_EQ(std::string(entry->name), std::string(47, 'n'));
}

// Every supported directory index remains selectable, including the final
// partial page. The next request must never wrap its one-byte wire index.
TEST_F(FileBrowserResponseTest, CompleteDirectoryReachesFinalIndexWithoutWrapping) {
    const auto& capture = GetInterMcuCapture();
    constexpr unsigned count = WaveX::Protocol::BROWSE_DIRECTORY_ENTRY_LIMIT;
    for (unsigned start = 0; start < count; start += 20) {
        ASSERT_EQ(capture.browse_req_start_index, start);
        std::vector<FileEntryWire> entries;
        for (unsigned index = start; index < start + 20 && index < count; ++index) {
            char name[20];
            std::snprintf(name, sizeof(name), "kit%03u.wxi", index);
            entries.emplace_back(0, 100, name);
        }
        Respond(count, entries);
    }
    ASSERT_EQ(wavex_file_browser_get_entry_count(browser_), count);
    EXPECT_EQ(capture.browse_req_calls, 13);
    EXPECT_EQ(capture.browse_req_start_index, 240);
    wavex_file_browser_set_selection(browser_, 255);
    const auto* selected = wavex_file_browser_get_selected(browser_);
    ASSERT_NE(selected, nullptr);
    EXPECT_STREQ(selected->name, "kit255.wxi");
    EXPECT_STREQ(selected->path, "/kit255.wxi");
}

