pmorgantech/WaveX/firmware/esp32/tests/unit/ui/file_browser_test.cpp
TEST_F(FileBrowserResponseTest, ReceiveDoesNotMutateUiStateUntilService) {
    const auto payload = Correlate(BuildBrowsePayload(1, {FileEntryWire(0, 100, "deferred.wav")}));
    stats_->invoke_browse_resp_callback(payload.data(), payload.size());
    EXPECT_EQ(browser_->entry_count, 0u);
    wavex_file_browser_process_pending_updates(browser_);
    ASSERT_EQ(browser_->entry_count, 1u);
    EXPECT_STREQ(browser_->entries[0].name, "deferred.wav");
    stats_->invoke_storage_status_callback(false);
    EXPECT_TRUE(browser_->storage_mounted);
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_FALSE(browser_->storage_mounted);
    EXPECT_EQ(browser_->entry_count, 0u);
}
TEST_F(FileBrowserResponseTest, ReplyOverflowClearsListingInsteadOfPublishingPartialState) {
    const auto payload = Correlate(BuildBrowsePayload(1, {FileEntryWire(0, 100, "queued.wav")}));
    for (int i = 0; i < 5; ++i)
        stats_->invoke_browse_resp_callback(payload.data(), payload.size());
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_EQ(browser_->entry_count, 0u);
    EXPECT_FALSE(wavex_file_browser_loading(browser_));
}

TEST_F(FileBrowserResponseTest, RejectsPreviousDirectoryPageAndDuplicateReply) {
    Respond(25, std::vector<FileEntryWire>(20, FileEntryWire(0, 100, "old.wav")));
    const auto old_tail =
        Correlate(BuildBrowsePayload(25, {FileEntryWire(0, 100, "old-tail.wav")}));
    ASSERT_TRUE(wavex_file_browser_navigate_to(browser_, "/NEW"));
    stats_->invoke_browse_resp_callback(old_tail.data(), old_tail.size());
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_EQ(browser_->entry_count, 0u);
    EXPECT_TRUE(wavex_file_browser_loading(browser_));
    const auto fresh = Correlate(BuildBrowsePayload(1, {FileEntryWire(0, 100, "new.wav")}));
    stats_->invoke_browse_resp_callback(fresh.data(), fresh.size());
    wavex_file_browser_process_pending_updates(browser_);
    ASSERT_EQ(browser_->entry_count, 1u);
    EXPECT_STREQ(browser_->entries[0].path, "/NEW/new.wav");
    stats_->invoke_browse_resp_callback(fresh.data(), fresh.size());
    wavex_file_browser_process_pending_updates(browser_);
    EXPECT_EQ(browser_->entry_count, 1u);
}
